[
    {
        "profile": "Mark Nguyen",
        "role": "Software Engineer",
        "history": {
            "p1" : "Mark has 20+ years of experience in the technology sector, predominantly in the communications software and hardware field. He has worked with OEM companies, privately held companies, and a pre-IPO start-up.",
            "p2": "Mark started his career in 1997 working for Microsoft as a software-QA engineer. He later moved to the bay area working for an OEM telecommunication company where he worked as a software configuration management engineer and gradually moved into research and development. He is an expert engineer for applying Microsoft .NET technology, Database, and Backend open source integration.",
            "p2_2": "Mark enjoys developing all things related to back-end.  In 2001, Mark became a business partner and CTO of the same company rebranded as AES LLC.",
            "p3": "Mark has extensive experience and practical knowledge of software development life cycle. He spearheaded some engineering processes and practices while working at AES. He has been certified for Sun device driver development as well as for software configuration management by IBM ClearCase. He has been the principle R&D engineer responsible for three of the products released by AES Inc.",
            "p4": "Mark’s engineering expertise includes enterprise level original equipment application development, desktop client/server development and cross platform interoperability, network performance and analysis.",
            "p5": "Mark joined AES in 2001 and is the R&D manager responsible for research and development of new and advanced AES software products.\n\nMark obtained his Associate degree at the Monterey Peninsula College and his Bachelor of Science degree in Computer Engineering at CalPoly, San Luis Obispo, California.",
            "p6": "Developer program member at <a href='https://github.com/hurricanemark' target='_blank'>github.com/hurricanemark</a>",
            "p7": "Docker hub registry: <a href='https://hub.docker.com/u/marknre' target='_blank'>hub.docker.com/u/marknre</a>",
            "p8": "Mark is an avid outdoorsy who loves to camp, bike, hike, and fish.  He also cultivates a prety nice permaculture garden at home."

        }        
    }
]